import React from 'react';
import styled from 'styled-components';

const Container = styled.div`
  padding: 0.2rem;
  color: #4a4a4a;
`;

const P = styled.p`
  font-size: 0.12rem;
  color: #4a4a4a;
  margin: 0.05rem 0;
`;

/* eslint-disable */
const Agreement = () => (
  <Container>
    <P>
      本《协议》是您（下称“持有人”）与九路泊车云商（北京）科技有限公司（下称“九路云商”）之间关于停车位购买、委托建设、持有、转让等内容所订立的协议。本《协议》描述九路云商与持有人之间关于停车位购买、委托建设、持有、转让相关方面的权利义务。持有人是指注册、登录、使用、浏览本服务的个人或组织。
      本协议可视为《九路云商闪泊车云生态系统》（含其不同迭代版本，以下简称“软件”）的补充条款，与其构成统一整体，您对本协议的接受即受全部条款的约束，包括接受九路云商公司对任一服务条款随时所做的任何修改。本《协议》可由九路云商随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知。
      感谢您购买九路泊车云商（北京）科技有限公司停车位。本《九路泊车云商（北京）科技有限公司停车设备委托建设及委托管理协议》（“本协议”）由持有人与九路泊车云商（北京）科技有限公司共同签署。
    </P>
    <h2>鉴于：</h2>
    <P>1、九路云商是一家根据中华人民共和国（“中国”）法律依法成立并有效存续的有限公司；</P>
    <P>2、持有人拟委托九路云商及其关联方生产停车位及相应配套停车设备；</P>
    <P>3、持有人拟于九路云商生产完成后受买或长期租赁九路云商所生产之停车位；</P>
    <P>4、持有人拟将受买停车位委托九路云商及其关联方管理。</P>
    <P>
      各方根据《中华人民共和国合同法》、《中华人民共和国物权法》、《不动产登记暂行条例》（中华人民共和国国务院令第656号，2014年11月24日国总理李克强签发）、《不动产登记暂行条例实施细则》（国土资源部令第63号，2016年1月1日部长姜大明签发）、《不动产登记操作规范（试行）》（国土规【2016】6号）的相关规定和要求，经过友好协商，达成一致，特订立本协议如下条款，以供各方共同遵守。
    </P>

    <P>第一章 定义及相关产品规格</P>
    <P>第1条 停车设备：指用来存取储放车辆的机械或机械设备系统。</P>
    <P>
      第2条
      停车位：指独立存在或在停车设备中非独立存在可以停放一辆车辆的相应区位，以及该区位对应停车设备整体中所占部分权利人依法对该停车设备部分享有的直接支配和排他的权利，以及该区位的使用所必须占用停车设备整体而产生权利人依法对该停车设备享有的用益物权，以及该区位对应停车设备整体中所占部分权利人依法对该停车设备部分享有的担保物权（他物权）的权利（的权利总和）。
    </P>
    <P>第3条 产品标准：</P>
    <P>a) JB/T8910-1999《升降横移类机械式停车设备》；</P>
    <P>b) JB/T10215-2000《垂直循环类机械式停车设备》；</P>
    <P>c) JB/T10545-2006《平面移动类机械式停车设备》；</P>
    <P>d) JB/T8909-1999《简易升降类机械式停车设备》；</P>
    <P>e) 国质检[2003]174号《机电类特种设备制造许可规则》；</P>
    <P>f) 国务院第373号令《特种设备安全监察条例》；</P>
    <P>g) JB/T8713-1998《机械式停车设备类别、型式与基本参数》；</P>
    <P>h) GB17907-2010《机械式停车设备通用安全要求》。</P>
    <P>第4条 设计标准：</P>
    <P>a) JGJ100-1998《汽车库建筑设计规范》；</P>
    <P>b) GB50067-1997《汽车库、修车库、停车场设计防火规范》；</P>
    <P>c) DBJ08-60-97《机械式停车库设计规范（上海市标准）》；</P>
    <P>d) GB3811-1983《起重机设计规范》；</P>
    <P>e) GB4046-1993《电气设备安全设计导则》。</P>
    <P>第5条 工程标准：</P>
    <P>a) TJ213（四）《机械式停车场安装工程施工及验收规范》；</P>
    <P>b) JG5106-1998《机械式停车场安全规范总则》。</P>
    <P>第二章 项目建设依据</P>
    <P>第6条 九路云商的停车设备建设依据《中华人民共和国物权法》第七十四条建设，依法建设后，建设方享有对地上建设停车设备所形成不动产之归属和利用而产生的民事关系。</P>
    <P>第7条 《中华人民共和国物权法》第七十四条规定，“建筑区划内，规划用于停放汽车的车位、车库的归属，由当事人通过出售、附赠或者出租等方式约定”。</P>
    <P>第8条 持有人所受让的停车位无法办理土地证手续，但享有与所建土地同等年限的所有权（不享有土地使用权）。</P>
    <P>第三章 委托建设停车设备的基本情况</P>
    <P>第9条 持有人委托九路云商建设停车设备，并于停车设备建成后受让停车设备中的的停车位。购买停车位数量由持有人在九路泊车软件中勾选确定。</P>
    <P>第10条 停车位以及其配套停车设备应符合本合同中第一章所述关于产品规格的相关国家要求。</P>
    <P>第11条 委托建设停车设备的基本情况由本协议签署、本协议相关款项已经完成支付，且相关工程施工工作开始后另行通知。</P>
    <P>第12条 九路云商有权对停车位进行管理服务，并对停车位收取物业管理服务费。</P>
    <P>第13条 如需代政府收缴的物业维修专项基金在签订本转让合同时按政府有关规定由九路云商向持有人收取。</P>
    <P>第14条 停车位的销售特征为：【预售】。</P>
    <P>第四章 付款及抵质押情况</P>
    <P>
      第15条
      双方约定，停车位的价款及支付方式根据持有人在软件中选择购买的停车位类型选择去人。其中，对于选择全部产权的持有人，总应付家款为【10万元（大写：拾万圆整）】。持有人应在软件中支付【6500元（大写：陆仟伍佰圆整）】，剩余尾款应于下单购买之日起3个工作日一次性付清。其中，对于选择合并购买的持有人，总应付价款为【10万元（大写：拾万圆整）】。持有人应在软件中支付【6500元（大写：陆仟伍佰圆整）】，剩余尾款应于下单购买之日起3个工作日一次性付清。对于选择众筹购买的持有人，总应付家款为【6500元（大写：陆仟伍佰圆整）】，由持有人在软件中全部支付。
    </P>
    <P>第16条 如停车位价款支付方式为一次性付清，持有人依法对停车位享有全部权利；</P>
    <P>第17条 九路云商于停车设备建成后，向持有人出具相应权利证明。</P>
    <P>第18条 如停车位价款支付方式为分期缴付，持有人依法对停车位享有除他项权利以外全部权利，九路云商于停车设备建成后，向持有人出具设置抵押权限限制的权利证明，直至全部分期款项缴清后，予以清除该车位权利上的抵押设置。</P>
    <P>第19条 九路云商接收上述款项的账户为：</P>
    <P>微信支付</P>
    <P>或</P>
    <P>银行汇款</P>
    <P>账户名：九路泊车云商（北京）科技有限公司</P>
    <P>账号：604195669</P>
    <P>开户行：中国民生银行回龙观支行</P>
    <P>请注意：汇款账户名中的括号为全角括号，请用中文输入法输入</P>
    <P>第五章 委托管理</P>
    <P>第20条 车位建成且完成交割后，持有人依据本协议，将停车位委托九路云商进行出租管理并收取停车费用。</P>
    <P>第21条 持有人在此认可并确认车位的委托管理存在停车管理费、物业管理费、所得税费等相关费用。</P>
    <P>第六章 停车位的转让</P>
    <P>第22条 持有人可对其所持有停车位（包括设置抵押权限的停车位）进行转让。</P>
    <P>第23条 对于持有人持有设置他项权利（停车位被抵押的情况，下同）的停车位，持有人在转让时，其转让协议内容不可与本协议及停车位所设置的他项权利相冲突。</P>
    <P>第24条 持有人将停车位所欠全部剩余款项一次性缴清后，九路云商需在收到全部剩余款项后的五个工作日内解除设置在该停车位之上的他项权利。</P>
    <P>第25条 持有人在转让其持有停车位时，应确保其停车位受让主体方符合合法持有停车位的主体资格。</P>
    <P>第26条 持有人在完成转让其持有停车位后的三个工作日内应向九路云商进行备案。</P>
    <P>第27条 九路云商应在收到持有人据本协议第27条备案信息后的五个工作日内，向新的受让方出具相应权利证明文件。</P>
    <P>第28条 若持有人为自然人的，持有人在此承诺：对出现停车位溢价转让的情形，持有人应依据《中华人民共和国个人所得税法》缴纳个人所得税，九路云商对于持有人的纳税义务及行为不负担监督义务。</P>
    <P>第29条 若持有人为法人的，持有人在此承诺：对出现停车位溢价转让的情形，持有人应依据《中华人民共和国企业所得税法》缴纳增值税、企业所得税，九路云商对于持有人的纳税义务及行为不负担监督义务。</P>
    <P>第七章 各方承诺与保证</P>
    <P>第30条 持有人声明、承诺与保证如下：</P>
    <P>1) 持有人具有签署及履行本协议项下义务的合法主体资格，本协议系持有人真实的意思表示；</P>
    <P>2) 持有人有意愿、有能力履行本协议项下的付款义务，并愿意承担付款违约所导致的一切后果；</P>
    <P>3) 持有人用于支付本协议项下款项的资金来源合法，不存在非法汇集他人资金的情形，也不存在其他违反中华人民共和国法律法规的情形；</P>
    <P>4) 涉及所建停车项目因政府规划原因，需要被拆迁的情况，持有人应积极配合政府及政府委托方的拆迁计划。</P>
    <P>第31条 九路云商声明、承诺与保证如下：</P>
    <P>
      1)
      九路云商具有签署及履行本协议项下义务的合法主体资格，且九路云商签署本协议不会导致九路云商违反有关法律、法规、规范性文件以及九路云商的内部规章制度，也不存在与九路云商既往已签订的协议或已经向其他第三方所作出的任何陈述、声明、承诺或保证等相冲突之情形；
    </P>
    <P>2) 九路云商具备合格的、合法的、合规的停车设备生产技术、场地、设备及生产安装人员，能够实现本协议项下约定停车设备的生产及安装调试工作；</P>
    <P>
      3) 涉及所建停车项目因政府规划原因，需要被拆迁的情况，在持有人已取得车位完整产权权利并支付全部款项的前提下，九路云商应积极协调各关联方进行妥善处置。政府或其他受益方所提供之拆迁补偿应优先用于偿还持有人购置车位所支付本金。
    </P>
    <P>第八章 违约责任</P>
    <P>
      第32条
      构成违约的一方（以下简称“违约方”）同意对守约的另一方（以下简称“守约方”）因违约方对本协议任何条款的违反而可能发生或招致的一切权利主张、诉讼、损害、损失及花费（包括但不限于法律费用和花费以及对权利主张进行调查的成本）进行赔偿。守约方因该违约而享有的权利和救济应在本协议终止或履行完毕后继续有效。
    </P>
    <P>第九章 不可抗力</P>
    <P>第33条 本协议中“不可抗力”是指不能预见、不能避免并不能克服的客观情况。</P>
    <P>第34条 任何一方由于不可抗力事件且自身无过错造成的不能履行或部分不能履行本协议的义务将不视为违约，但应在条件允许下采取一切必要的救济措施，以减少因不可抗力造成的损失。</P>
    <P>
      第35条
      遇有不可抗力的一方，应尽快将事件的情况以书面形式通知其他协议方，并在事件发生后十五日内，向其他协议方提交不能履行或部分不能履行本协议义务以及需要延期履行（或有）的理由的报告。各方应在得知不可抗力事件后尽可能立即通过友好协商决定如何执行本协议。
    </P>
    <P>第十章 通知和送达</P>
    <P>
      第36条
      本协议项下的所有通知或其他沟通应采用书面方式或软件通知方式，并应送达或发送至联系地址、电子邮件地址或以手机短信方式通知。若任何一方的通讯方式发生变化，变化的一方应当提前3天书面通知对方该等变化。面呈的通知在被通知人签收时即视为有效送达，签收日期为送达日期，被通知人未签收的不得视为有效的送达；通过快递方式向指定通讯地址发出的通知，在快递被收件方公司任何员工或代表、代理签收即视为有效送达，签收日期为送达日期；电子邮件或或短信方式发出的通知，进入收件方指定的邮箱或通讯工具即视为有效送达，到达收件方指定邮箱的日期视为送达的日期；为体现更多的注意义务，发出通知的一方应当在发出通知后及时通过电话向收件人进行善意提醒。
    </P>
    <P>第37条 持有人确认其在软件中所填写地址及电话信息无误。</P>
    <P>第十一章 补充信息</P>
    <P>
      第38条
      签署本协议且付款后，持有人有权加入“九路泊车合伙人计划”并按九路泊车公司规章制度享有相应权利义务。九路泊车保留随时修改九路泊车合伙人计划各项福利待遇的权利并在软件或指定渠道公布。持有人可在公司软件、网站随时浏览或电话咨询。
    </P>
    <P>第39条 持有人签署本协议的推荐人为通过二维码确认。</P>
    <P>第十二章 其他</P>
    <P>第40条 本协议经持有人电子签署后成立。</P>
    <P>第41条 本协议的订立、履行、解释及争议的解决均应适用中国法律。</P>
    <P>第42条 如各方就本协议内容或其执行发生任何争议，各方应进行友好协商；协商不成时，任何一方均可将有关争议提交北京仲裁委员会按照该会届时有效的仲裁规则进行仲裁，仲裁地在北京，仲裁裁决是终局的，对各方均有法律效力。</P>
    <P>第43条 如后续合作过程中需要调整本协议，可由本协议各方经协商一致以书面形式达成补充协议。该等补充协议与本协议具有同等法律效力。</P>
    <P>第44条 未经本协议各方的法定代表人或授权代表签署书面修改协议，任何对本协议条款的变更、更改、或修改均不发生法律效力。</P>
    <P>第45条 本协议以中文书写并签署。本协议正本为电子档案，各方均可在指定网络渠道浏览或打印。</P>
    <P>第46条 本《协议》的版权由九路云商所有，九路云商保留一切解释和修改权利。</P>
    <P>第47条 本协议所有条款标题或字体的加粗、变形和条款的编号，仅为阅读方便，本身并无实际含义，不能作为本协议涵义解释的依据。</P>
    <P>第48条 若您对九路云商公司及本服务有任何意见，欢迎垂询九路云商公司客服中心。</P>
    <P>九路云商客户服务热线：010-57277318。</P>
    <P>服务网站：www.jr-c.cn。</P>
    <P>九路泊车云商（北京）科技有限公司</P>
  </Container>
);

export default Agreement;
