import React from 'react';

import { Container, Title } from './styledComponents';

/* eslint-disable  */
export default function Article() {
  return (
    <Container>
      <Title><b>托福词汇常用学习方法</b></Title><br/>
      <b>摘要</b>
        <p>
          托福汇是很多考生的一个痛点，因为这些词汇很难掌握，有时候背了还是很容易忘记。那么接下来，小编为大家整理一些托福词汇常用学习方法，供大家参考和学习，帮助大家攻克这一难关。
        </p>
        <br/>
        <p>
          1. 词根词缀法：最老生常谈的记忆方式。各个单词在记忆的时候，可拆分成词根加前后缀。这是目前市面上被证实最科学最有效率的记忆方法。如果有英语基础的同学，建议大家可以在英语学习的论坛上先下载前后缀的罗列表，把它记得烂熟，然后再下载常见的词根，从头到尾记忆一遍。做好这个步骤后，再按前后缀加上词根的拆分法则，挨个去背诵每一个单词。这样的话能够实现效率最大化。如此一来，每个单词瞬间就从一堆英文字母变成了词根词缀的细分内容，好似中文的偏旁部首有助于记忆单词是一样的方式。<br/>
        </p>
        <p>
          2. 形近义近归纳法：在托福高频词汇中，有很多词的形状很相似，这个就称之为形近。再比如有很多单词意思是差不多，这个就叫做义近。在背诵时就可以把这些单词总结在一起背，以防混淆。<br/>
        </p>
        <p>
          3. 联想归类记忆法：在高端词汇中，我们会碰到各种各样分门别类的词汇，把这些词汇按照各种类别把它区分开来加以背诵，就可以收到非常好的效果。例如：音乐、医学、社会、人文、娱乐等。<br/>
        </p>
    </Container>
  );
}
